# data = [
#     *([0 for i in range(100)] for line in range(10)),
#     *([1001 for i in range(100)] for line in range(10)),
# ]

from basic import Label, Button, la
import noise
data = noise.map

chat_data = {}
chat_conn = {}
chat_images = {}
chat_hides = []

def init_data():
    global chat_data, chat_conn, chat_images, chat_hides

    actor_1 = la('作者1')
    actor_2 = la('作者2')
    actor_3 = la('作者3')
    actor_4 = la('作者4')

    chat_data = {
        '0': [
            Label('欢迎来到IDU世界！', (30, 10), bg_color=(0, 0, 0, 0), alpha = 255),
            Label('我是世界的创造者——作者！你可以叫我有思想的不定积分。', (30, 30), bg_color=(0, 0, 0, 0), alpha = 255),
            Label('让我来教你一些基础操作吧。             可以继续查看对话！', (30, 50), bg_color=(0, 0, 0, 0), alpha = 255),
            Label('[单击任意处]', (290, 50), color = (255, 0, 0), bg_color = (0, 255, 0), alpha = 255),
        ],
        '0>': [
            Label('现在你学会了继续对话，以后都是这样！', (30, 10), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('有时候对话中也会出现按钮，你必须选择一个。', (30, 30), bg_color = (0, 0, 0, 0), alpha = 255),
            Button('继续', (200, 60), alpha = 188),
        ],
        '0>继续': [
            Label('很好！接下来让我们尝试进行运动！', (30, 10), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('这个红色的小可爱就是玩家扮演的角色。你可以为它起个名字。', (30, 30), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('你可以使用wad操控它移动。注意还有重力。', (30, 50), bg_color = (188, 0, 0, 255), alpha = 255),
        ],
        '0>继续>': [
            Label('长按r可以蓄力。在按住r时跑跳可以更快、更高。', (30, 10), bg_color = (0, 0, 188, 255), alpha = 255),
            Label('不过，会消耗更多体力。这个过会再说。', (30, 30), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('按z可以下蹲……小小的也很可爱呢！', (30, 50), color = (0, 0, 0), bg_color = (255, 111, 255, 255), alpha = 255),
        ],
        '0>继续>>': [
            Label('窗口下方有9格物品，你可以按对应数字键或滚轮选中。', (30, 10), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('按q可以扔出手中的物品。', (30, 30), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('按e可以打开/关闭背包，你可以在这里面装更多物品。', (30, 50), bg_color = (255, 0, 0, 255), alpha = 255),
        ],
        '0>继续>>>': [
            Label('左键可以破坏方块，右键可以放置方块。', (30, 10), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('有些方块需要特殊的工具才能开采。', (30, 30), bg_color = (188, 0, 0, 255), alpha = 255),
            Label('挖到会有掉落物，碰到后可以收集到物品栏或者背包。', (30, 50), bg_color = (0, 0, 0, 0), alpha = 255),
        ],
        '0>继续>>>>': [
            Label('背包中，鼠标左右键、滚轮可以交换物品。', (30, 10), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('功能很多，快去试试吧！', (30, 30), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('对了，s打开选择模式，按住拖动的格子可以选中。', (30, 50), bg_color = (0, 0, 0, 0), alpha = 255),
        ],
        '0>继续>>>>>': [
            Label('选中之后可以批量操作，a还能平均分配物品。', (30, 10), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('f扩展到矩形内全部选中，这些聪明人自己试试就会了。', (30, 30), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('上方2*2的是合成栏，可以合成新物品。', (30, 50), bg_color = (0, 0, 0, 0), alpha = 255),
        ],
        '0>继续>>>>>>': [
            Label('物品栏上方左边是血条，右边是饥饿值。', (30, 10), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('饥饿耗完会掉血，饥饿上面是饱食度，会被先消耗。', (30, 30), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('饱食度足够时会回血。对了，落地过猛也会掉血。', (30, 50), bg_color = (0, 0, 0, 0), alpha = 255),
        ],
        '0>继续>>>>>>>': [
            Label('你可以去打羊（单击那个会动的东西）', (30, 10), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('上面有它的血条，把它打死后它会掉羊肉，右键吃掉。', (30, 30), bg_color = (0, 0, 0, 0), alpha = 255),
            Label('还有，饥饿值>50的时候不能按r蓄力，因为你没那个气力。', (30, 50), bg_color = (0, 0, 0, 0), alpha = 255),
        ],
        '0>继续>>>>>>>>': [
            Label('好了，我还有别的玩家要接待。', (30, 10), 30, bg_color = (0, 0, 0, 0), alpha = 255),
            Label('我先走一步，再见！希望你玩得开心！', (30, 40), 30, bg_color = (0, 0, 0, 0), alpha = 255),
        ],
        '0>继续>>>>>>>>>': [
            Label('下次编写剧本。', (30, 10), 30, bg_color = (0, 0, 0, 0), alpha = 255),
        ],
    }

    chat_conn = {
    }

    chat_images = {
        '0': (actor_1, (180, 50)),
        '0>继续>>>>>>>>': (actor_4, (180, 50)),
    }

    chat_hides = [
        '0>继续>>>>>>>>>'
    ]